{
  "framework-mods/2025-04-23_2025-04-23_updated-transcript-analysis_framework-mods.md": [
    [
      "regulatory-models",
      "ss affects his regulation capabilities and develop strategies to enhance this skill. #interoception #regulatory-models\n"
    ]
  ],
  "framework-mods/2025-04-23_04-23-2025_executive-function-battery-adhd-entrepreneurship_framework-mods.md": [
    [
      "client-centered-applications",
      " challenges\n- Communication strategies for client and employee interactions\n\n#adhd-entrepreneurship #client-centered-applications\n"
    ]
  ],
  "framework-mods/2025-04-23_tropism-model-accommodation-mapping_framework-mods.md": [
    ["variotropism", "An attention pattern characterized by scattered, inconsistent focus that shifts based on novelty and stimulation demands, primarily associated with ADHD neurotype but distinct from polytropic attention. This concept helps differentiate ADHD attention patterns from both autistic and neurotypical attention allocation. #neurological-frameworks #variotropism"],
    ["tropism-attachment-matrix", "An integrated framework that maps how attention styles (monotropism, polytropic, variotropic) interact with attachment patterns, providing insight into relational dynamics for neurodivergent individuals. This extends beyond typical monotropism theory by explicitly connecting attention patterns to relational dynamics. #systems-perspectives #tropism-attachment-matrix"],
    ["accommodation-mapping", "A structured approach to documenting and implementing neurodivergent accommodations across different environments, with emphasis on identifying energy expenditure and developing targeted supports. This approach moves beyond ad-hoc accommodations to a systematic mapping across contexts. #practical-strategies #accommodation-mapping"]
  ],
  "framework-mods/2025-04-25_safety-system-framework-neurodivergent-couples_framework-mods.md": [
    ["safety-system", "A universal neurobiological framework for understanding protective responses that all humans possess, encompassing fight, flight, freeze, and fawn reactions, which becomes problematic only when chronically activated or imbalanced. This destigmatizing framework allows for discussion of protective responses without requiring trauma identification. #neurological-frameworks #safety-system"],
    ["hybrid-response-states", "The simultaneous activation of two or more safety responses (e.g., freeze-flight, fight-fawn), creating unique physiological and psychological experiences that require specific therapeutic approaches. This is particularly relevant for neurodivergent individuals who often experience complex, overlapping regulatory states. #regulatory-models #hybrid-response-states"],
    ["bidirectional-advocacy", "A mutual approach to self-advocacy in relationships where partners both express their own needs and help remind/support their partner in recognizing and expressing needs, particularly valuable for neurodivergent relationships. This expands traditional self-advocacy models. #communication-approaches #bidirectional-advocacy"],
    ["neurodivergent-couples", "Partnerships where one or both individuals are neurodivergent, presenting unique relational dynamics that require specific understanding of how different neurotypes interact in intimate relationships. #systems-perspectives #neurodivergent-couples"]
  ],
  "framework-mods/2025-04-30_double-empathy-neurodivergent-parenting-couples_framework-mods.md": [
    ["values-based-negotiation", "A collaborative approach for neurodivergent relationships that focuses on identifying shared underlying values rather than specific behavioral expectations, allowing different neurological styles to implement the same core values in ways that honor their processing differences. This approach moves beyond procedural alignment to focus on what matters most to both partners. #communication-approaches #values-based-negotiation"],
    ["perspective-complementarity", "The recognition that different neurological processing styles lead to complementary observational strengths (e.g., macro pattern recognition versus micro detail focus), which can be integrated rather than positioned as competing approaches. This is particularly valuable for co-parenting partnerships where different perspectives offer complementary insights. #neurological-frameworks #perspective-complementarity"],
    ["we-solutions", "A framework for neurodivergent relationship problem-solving that intentionally frames challenges as shared territory requiring mutual accommodation rather than positioning one partner's approach as normative. This addresses power imbalances that often develop in neurodivergent relationships where one neurological style becomes the standard. #systems-perspectives #we-solutions"]
  ],
  "framework-mods/2025-05-15_fear-motivation-neurodivergent-therapy_framework-mods.md": [
    [
      "self-accommodation",
      "/external support frameworks\n- Language for reframing self-criticism through a neurodiversity lens\n\n#self-accommodation #self-compassion\n\n### Expand \"Dialectical Understanding\" to Include Neurodivergent-Specific Dialectics\n\nThe framework would benefit from explicitly identifying dialectical tensions that are particula"
    ],
    [
      "self-compassion",
      "ameworks\n- Language for reframing self-criticism through a neurodiversity lens\n\n#self-accommodation #self-compassion\n\n### Expand \"Dialectical Understanding\" to Include Neurodivergent-Specific Dialectics\n\nThe framework would benefit from explicitly identifying dialectical tensions that are particularly salient for n"
    ],
    [
      "neurodivergent-experience",
      "on - The balance between true self-expression and necessary adjustments\n\n#dialectical-understanding #neurodivergent-experience\n\n### Add \"Parent-Child Mirroring\" to Systems Perspectives\n\nThe transcript reveals how parenting neurodivergent children creates therapeutic opportunities through mirroring, which deserves systematic "
    ],
    [
      "parent-child-mirroring",
      " extending child-directed accommodations to self\n- Methods for breaking intergenerational patterns\n\n#parent-child-mirroring #family-systems\n\n### Create \"Fear-Motivation Relationship\" Under Regulatory Models\n\nThe transcript highlights the complex relationship between fear and motivation in ADHD, which warrants dedicated fr"
    ],
    [
      "family-systems",
      "d accommodations to self\n- Methods for breaking intergenerational patterns\n\n#parent-child-mirroring #family-systems\n\n### Create \"Fear-Motivation Relationship\" Under Regulatory Models\n\nThe transcript highlights the complex relationship between fear and motivation in ADHD, which warrants dedicated framework attentio"
    ],
    [
      "fear-avoidance",
      "oaches for interest-based nervous systems\n- Reframing avoidance as information rather than failure\n\n#fear-avoidance #motivation-systems\n\n### Add \"Humor as Engagement Strategy\" to Communication Approaches\n\nThe transcript demonstrates how humor serves as a powerful engagement tool for maintaining attention and reduc"
    ],
    [
      "motivation-systems",
      "est-based nervous systems\n- Reframing avoidance as information rather than failure\n\n#fear-avoidance #motivation-systems\n\n### Add \"Humor as Engagement Strategy\" to Communication Approaches\n\nThe transcript demonstrates how humor serves as a powerful engagement tool for maintaining attention and reducing shame in ADHD th"
    ],
    [
      "therapeutic-humor",
      "tic relationship building through shared humor\n- Balance between humor and therapeutic seriousness\n\n#therapeutic-humor #engagement-strategies"
    ],
    [
      "engagement-strategies",
      "ilding through shared humor\n- Balance between humor and therapeutic seriousness\n\n#therapeutic-humor #engagement-strategies"
    ]
  ],
  "framework-mods/2025-04-23_2025-04-23_combined-neurotype-analysis_framework-mods.md": [
    [
      "regulatory-models",
      "accommodations and adaptations can actually increase overall capacity, not just manage limitations. #regulatory-models #energy-battery\n"
    ]
  ],
  "framework-mods/2025-04-23_04-23-2025_parenting-neurodivergent-adolescents-accommodations_framework-mods.md": [
    [
      "parent-accommodations",
      "d dysregulation\n- Intergenerational pattern recognition and modification\n\n#neurodivergent-parenting #parent-accommodations\n"
    ]
  ],
  "framework-mods/2025-04-23_04-23-2025_analyzed-transcript-1_framework-mods.md": [
    [
      "category-tag",
      "tegory \n\nTo include [NEW CONCEPT] - This moves beyond [CURRENT MODEL] to include [NEW PERSPECTIVE]. #category-tag #concept-tag\n"
    ],
    [
      "concept-tag",
      "clude [NEW CONCEPT] - This moves beyond [CURRENT MODEL] to include [NEW PERSPECTIVE]. #category-tag #concept-tag\n"
    ]
  ],
  "framework-mods/2025-04-23_04-23-2025_three-part-communication-neurodivergent-couples_framework-mods.md": [
    [
      "communication-approaches",
      " Process-focused feedback loops\n- Communication about communication preferences\n\n#metacommunication #communication-approaches\n"
    ]
  ]
}