{
  "framework-mods/2025-04-23_04-23-2025_executive-function-battery-adhd-entrepreneurship_framework-mods.md": [
    ["adhd-entrepreneurship", "Given the prevalence of entrepreneurship among individuals with ADHD and the unique challenges and strengths they bring to business ownership, a dedicated category would be valuable. This would include:\n- Executive function allocation strategies for business owners\n- Interest-based business development approaches\n- Delegation frameworks that complement ADHD strengths and challenges\n- Communication strategies for client and employee interactions\n\n#adhd-entrepreneurship #client-centered-applications"]
  ],
  "framework-mods/2025-04-23_04-23-2025_three-part-communication-neurodivergent-couples_framework-mods.md": [
    ["metacommunication", "Given the emphasis on communicating about communication processes, a dedicated category on metacommunication would be valuable. This would include:\n- Gateway prompts to signal cognitive states\n- Operating system mode identification\n- Process-focused feedback loops\n- Communication about communication preferences\n\n#metacommunication #communication-approaches"]
  ],
  "framework-mods/2025-04-23_04-23-2025_parenting-neurodivergent-adolescents-accommodations_framework-mods.md": [
    ["neurodivergent-parenting", "Given the prevalence of neurodivergent parents raising neurodivergent children, a dedicated category would be valuable. This would include:\n- Accommodations for executive function challenges in parenting\n- Communication strategies across different processing styles\n- Self-regulation supports for parents during child dysregulation\n- Intergenerational pattern recognition and modification\n\n#neurodivergent-parenting #parent-accommodations"]
  ],
  "framework-mods/2025-04-23_2025-04-23_combined-neurotype-analysis_framework-mods.md": [
    ["energy-battery", "This moves beyond static depletion models to include the idea that accommodations and adaptations can actually increase overall capacity, not just manage limitations. #regulatory-models #energy-battery"]
  ],
  "framework-mods/2025-04-23_2025-04-23_updated-transcript-analysis_framework-mods.md": [
    ["interoception", "While the transcript mentions interoception briefly, this concept deserves expanded treatment in the framework. Interoception (internal body awareness) is increasingly recognized as fundamental to emotional regulation in neurodivergent individuals. Future sessions could explore how Clayton's interoceptive awareness affects his regulation capabilities and develop strategies to enhance this skill. #interoception #regulatory-models"]
  ]
}